# Представлен список чисел. Определить элементы списка, не имеющие повторений. 
# Сформировать из этих элементов список с сохранением порядка их следования в исходном списке, например:
# src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
# result = [23, 1, 3, 10, 4, 11]


# Подсказка: напишите сначала решение «в лоб». Потом подумайте об оптимизации.

src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]

result_set = set()
tm_set = set()

for el in src:
    if el in tm_set:
        result_set.discard(el)
    else:
        result_set.add(el)
        tm_set.add(el)
    
result = [el for el in src if el in result_set]

print(result)